{
  "navbar":{
    "home":"Home",
    "about":"About me",
    "projects": "Projects",
    "contact":"Contact"
  },
  "language": "Choose language",
  "title": "Iván Pérez - Portfolio",
  "hello": "Hello! I am",
  "tagline": "Software Engineer",
  "location": "Madrid Area, Spain",
  "age": "June 12th, 1995",
  "education": {
    "title": "Education",
    "degree1": "Degree in Software Engineering",
    "degree2": "High School diploma",
    "uni": "Rey Juan Carlos University",
    "school": "La Salle Griñón School"
  },
  "languages": {
    "title": "Languages",
    "choose": "Choose a language:",
    "es": "Spanish",
    "en": "English",
    "native": "(Native)"
  },
  "interest": {
    "title": "Interests",
    "algorithm": "&#9679 Algorithm",
    "cp": "&#9679 Competitive Programing"
  },
  "hobbies": {
    "r": "&#9679 Reading",
    "t": "&#9679 Travelling",
    "vg": "&#9679 Videogames"
  },
  "summary": {
    "title": "Career Profile",
    "t1": "I am team player software engineer with a can-do attitude, phenomenal time management skills, and a strong user focus. Energetic and deep creative thinker.",
    "t2": "Currently I am working on my degree's final project, focused on developing and working with TSP algorithms with the oficial TSPLib."
  },
  "personalProfile": {
    "title": "Personal Profile",
    "p2": "I have developed software in many languages, such as Java, C and Python.",
    "job1": "Freelance Developer",
    "job2": "Software Developer",
    "date1": "2016 - Present",
    "date2": "Dec 2018 - Dec 2020",
    "date3": "Feb 2021 - Present",
    "company1": "Personal and Collaborative projects",
    "company2": "Work4Data | I+D Software Lab",
    "company3": "VIEWNEXT",
    "details": {
      "p1": "I composed an android app simulating the game Space Invaders then apply and try out different testing tools, like Selenium and I also implemented BDD through Cucumber.",
      "p2": "Collaborating on developing a Telegram bot to automate multiple task.",
      "p3": "Worked with Java + Spring framework for multiple projects. I built a RESTful API for an online GYM with this tecnology.",
      "p11": "Frontend and Backend development. Work with Spring Boot, AngularJS, Bootstrap, PostgreSQL, OracleSQL, MSSQL.",
      "p12": "Hibernate/JPA implementation, Java/Maven development.",
      "p13": "General knowledge of RESTful APIs and JSON. Experience in Webservices (REST and SOAP).",
      "p14": "Agile Development Experience. Continuous Integration / Continuous Delivery using DevOps tools and workflows such as Git, GitLab, Jira, and Jenkins.",
      "p15": "Java and Python microservices Backend Developer.",
      "p151": "Worked with Java 11+, Spring Boot 2, Spring Framwork 5 applying mainly reactive programming methodologies, developing web applications.",
      "p152": "Python microservices with Python 3 and Flask framework",
      "p16": "Reactive Spring Data repositories and Maven as project management tool and MonogoDB and OracleSQL as databases.",
      "p17": "Test cases for unit and integration testing using JUnit and Mockito. Experience in SONAR to generate and review quality of code.",
      "p18": "Assisted in facilitating the Scrum ceremonies such as: Product Increment planning, sprint planning, daily stand ups, sprint demos, and retrospectives.",
      "p19": "Continuous Integration / Continuous Delivery using tools such as Git, Github, Jenkins, Openshift, Jira and Kanban board."
    }
  },
  "projectsCourses": {
    "title": "Projects & Courses",
    "description1": "Side projects and MOOCs I have done.",
    "description2": "You can follow everything I am working on at the moment on my Github, feel free to check it out.",
    "fiturjc": "A responsive website template designed to simulate a GYM, using Spring FrameWork, Angular 5, MySQL, Bootstrap Template and HTML/CSS.",
    "competitive": "Solving problems of multiples online judges such as SPOJ or 'Acepta el reto' as a hobby.",
    "onlineCourses": {
      "title": "Online Courses",
      "course1": "Pursued my passion for Java and Python language.",
      "course2": "Best practices for software development and testing.",
      "course3": "Learned basic concepts of cybersecurity, the main attacks and the necessary countermeasures to deal with it.",
      "course4": "Technology and business model based on the Web, agility and mobility.",
      "course5": "Basic understanding of the Scrum framework.",
      "course6": "Initialization to participate in real competition: Ability to write efficient, reliable, and compact code. I also learnt how to manage time well when it is limited and how to apply basic algorithmic ideas to real problems.",
      "course7": "Introduction to Git Course",
      "course8": "Initialization to git, learned the basic about git workflow and git commands",
      "course9": "Docker & Kubernetes",
      "course10": "Deploy Docker applications manually, with managed services or with Kubernetes/AWS",
      "course11": "Reactive Programming with Spring Boot 2 and Spring WebFlux",
      "course12": "Building non-blocking and asynchronous reactive applications with Spring Boot 2 and Spring WebFlux. Connecting to NoSQL databases (MongoDB), testing with JUnit and WebTestClient and consuming services with WebClient and Spring Cloud Eureka.",
      "course13": "Review on versions 8 and 11 with the latest, and everything you need to know about the new versions of java (17/21) in a theoretical and practical way."
    }
  },
  "projects":{
    "card1":{
      "title": "Competitive Programing",
      "description": "Coding problems",
      "languaje": "Java",
      "line1":"A Repository for Competitive Coding Problems Solutions.",
      "line2":"Solving problems from 'Acepta el Reto', SPOJ, Kattis and other problem websites.",
      "line3":"Solving problems from different competitions such as Ada Byron, SWERC or '12 uvas'."
    },
    "card2":{
      "title": "Portfolio",
      "description": "Personal web",
      "languaje": "HTML5, CSS3, Javascript",
      "line1":"My personal portfolio which features some of my github projects as well as my resume, technical skills and ways to contact me.",
      "line2":"This website was built with plain HTML/CSS and some Javascript.",
      "line3":"Fully responsive, multi-page layout, styled with Bootstrap and CSS and support dark and light theme."
    },
    "card3":{
      "title": "FitURJC",
      "description": "A responsive website template designed to simulate a GYM",
      "languaje": "Java 8, Spring Framework, Angular 5, MySQL",
      "line1":"Worked with Spring FrameWork/Java, Angular 5, MySQL, Bootstrap Template and HTML/CSS.",
      "line2":"Implemented a REST full integration for Login, Sing up and administrate users, courses and clases inside the gym.",
      "line3":"Other tecnologies and tools used: Docker, Travis CI and UML diagrams.",
      "line4":"Worked in a team of 4, implementing agile methologies such as Scrum and Kanban board."
    },
    "card4":{
      "title": "My Shell",
      "description": "MINIMUM VIABLE VERSION OF A REAL SHELL",
      "languaje": "C",
      "line1":"The implemented minishell pretends to works as the original.The idea is to provide a basic personal minishell.",
      "line2":"The main goal is to have a good understanding of process creation and synchronisation using the C programmming language."
    },
    "card5":{
      "title": "VS Code Custom Theme",
      "description": "My own customised vscode theme",
      "languaje": "JSON & CSS",
      "line1":"Halloween inspired theme with mainly orange and purple colours.",
      "line2":"Available as an extension in the Microsoft market place."
    },
    "card6":{
      "title": "Expiring on Netflix soon",
      "languaje": "Python + WebScraping",
      "line1":"Movies and series from Netflix 'My List' that are going to be removed soon.",
      "line2":"Done with Python and WebScraping with Selenium webdriver."
    }
  },
  "skills": {
    "title": "Skills & Proficiency",
    "p1": "Backend developer with passion for APIs. Great interest in Problem solving, Datastructures and Algorithms.",
    "p2": "Solid working knowledge of source control management systems (i.e. Git) and effective code branching/merging strategies.",
    "p3": "Experience using Agile development methodology and Continuous Integration/Delivery.",
    "p4": "General knowledge of Spring and the Spring ecosystem (Spring Boot, Spring REST, Spring MVC, Spring Security)"
  },
  "contact": {
    "touch1": "Let's get in touch",
    "touch2": "touch",
    "name": "Enter your name:",
    "email": "Enter email address:",
    "subject": "Enter subject:",
    "message": "Enter message:",
    "send": "Send Message"
  },
  "confirmation":{
    "emailTitle": "Thank You !",
    "emailMessage": "Your submission has been received."
  },
  "404":{
    "text":"Oops! Page Not Found"
  }
}
