{
  "navbar":{
    "home":"Inicio",
    "about":"Sobre mí",
    "contact":"Contacto"
  },
  "language": "Elija un idioma",
  "title": "Iván Pérez - Portfolio",
  "hello": "Hola! Soy",
  "tagline": "Ingeniero de Software",
  "location": "Madrid, Spain",
  "age": "12 de junio de 1995",
  "education": {
    "title": "Educación",
    "degree1": "Grado en Ingeniería del Software",
    "degree2": "Bachillerato",
    "uni": "Universidad Rey Juan Carlos",
    "school": "Colegio La Salle Griñón"
  },
  "languages": {
    "title": "Idiomas",
    "choose": "Elija un idioma:",
    "es": "Español",
    "en": "Inglés",
    "native": "(Nativo)"
  },
  "interest": {
    "title": "Intereses",
    "algorithm": "&#9679 Algoritmia",
    "cp": "&#9679 Programación Competitiva"
  },
  "hobbies": {
    "r": "&#9679 Leer",
    "t": "&#9679 Viajar",
    "vg": "&#9679 Videojuegos"
  },
  "summary": {
    "title": "Perfil profesional",
    "t1": "Soy una persona a la que le gusta trabajar en equipo, con una estupenda gestión del tiempo y un enfoque pensado en el usuario. Me considero creativo, resolutivo y con iniciativa."
  },
  "personalProfile": {
    "title": "Perfil personal",
    "p2": "He desarrollado software en distintos lenguajes, con una preferencia por Java , Python y en menor medida C.",
    "job1": "Desarrollador independiente",
    "job2": "Desarrollador de Software",
    "date1": "2016 - Hoy",
    "date2": "Dic 2018 - Dic 2020",
    "date3": "Feb 2021 - Hoy",
    "company1": "Proyectos personales y colaborativos",
    "company2": "Work4Data | I+D Software Lab",
    "company3": "VIEWNEXT",
    "details": {
      "p1": "Desarrollo de un 'space invaders' en android y luego aplicar con esta  BDD con Jenkins/Cucumber y diferentes heramientas de testing como Selenium. ",
      "p2": "Colaborando para desarrollar un bot de Telegram que facilita la automatización de tareas.",
      "p3": "He trabajado con Java + Spring para multiples proyectos. He desarrollado un API RESTful para una aplicación que simulaba el funcionamiento de un gimnasio online.",
      "p11": "Desarrollador Frontend y Backend. He trabajado con Spring Boot, AngularJS, Bootstrap, PostgreSQL, OracleSQL, MSSQL.",
      "p12": "Implementación con Hibernate/JPA, desarrollo con Java/Maven.",
      "p13": "Conocimiento general de APIs RESTful y JSON. Experiencia en Webservices (REST and SOAP).",
      "p14": "Experiencia en el desarrollo ágil. Integración contínua / Entrega contínua usando herramientas DevOps como Git, GitLab, Jira, y Jenkins.",
      "p15": "Desarrollo Backend con microservicios en Java y Python.",
      "p151": "Trabajando con Java 8+, Spring Boot 2, Spring Framwork 5 principalmente aplicando metodologías de programación reactiva para el desarrollo de aplicaciones web.",
      "p152": "Microservicios con Python 3 y el framework Flask.",
      "p16": "Repositorios reactivos de Spring Data y Maven como sistema para construir el proyecto y MonogoDB como base de datos.",
      "p17": "Casos de prueba, tanto unitario como de integración con JUnit y Mockito. Experiencia en SONAR para generar, asegurar y revisar la calidad del código.",
      "p18": "Participación activa en las reuniones y actividades de metodología Scrum como: Incremento del valor del producto, sprint planning, dailies , sprint demos, y retrospectivas.",
      "p19": "Integración contínua / Entrega contínua usando herramientas como Git, Github, Jira y tablero Kanban."
    }
  },
  "projectsCourses": {
    "title": "Otros proyectos y cursos",
    "description1": "Otros proyectos, cursos y MOOCs que he hecho",
    "description2": "Puedes ver todo lo que estoy haciendo en mi Github.",
    "fiturjc": "Una web responsive simulando el funcionamiento de un gimnasio, usando Spring FrameWork, Angular 5, MySQL, Bootstrap Template y HTML/CSS para el desarrollo.",
    "competitive": "Repositorio para resolver distintos problemas de programación competitiva, de multiples jueces online como SPOJ o 'Acepta el reto', por hobby.",
    "onlineCourses": {
      "title": "Cursos Online",
      "course1": "Cursos sobre Java y Python.",
      "course2": "Mejores prácticas en el desarrollo de software y testing.",
      "course3": "Conceptos básicos de ciberseguridad, los principales ataques y sus contramedidas.",
      "course4": "Conceptos básicos y avanzados sobre el desarrollo ágil en todas sus etapas, así como su historia.",
      "course5": "Conocimiento básico sobre Scrum, etapas y roles dentro del modelo.",
      "course6": "Iniciación para participar en competiciones reales: Capacidad para escribir codigo eficiente, seguro y breve. También aprendí a administrarme el tiempo y a aplicar conceptos de algoritmia a problemas reales.",
      "course7": "Introducción a Git",
      "course8": "Iniciación a git, su workflow y comandos.",
      "course9": "Docker & Kubernetes",
      "course10": "Utilizacion de docker y kubernetes junto con AWS para contener y desplegar aplicaciones",
      "course11":"Programacion Reactiva con Spring Boot 2 y Spring WebFlux",
      "course12":"Contrucción de aplicaciones reactivas sin bloqueo y asincronas con Spring Boot 2 y Spring WebFlux. Conexion con bases de datos NoSQL (MongoDB) , testeo con JUnit y WebTestClient y consumición de servicios con WebClient y Spring Cloud Eureka."
    }
  },
  "skills": {
    "title": "Habilidades & Competencia",
    "p1": "Desarrollador backend con pasión por las APIs. Con un gran interés en Estructura de datos, Algoritmia y la resolución de problemas",
    "p2": "Conocimiento sólido sobre los sistemas de control de versiones (Git) y estrategias eficientes de administración de ramas y mergeo.",
    "p3": "Experiencia usando herramientas de desarrollo ágil e integración continua.",
    "p4": "Conocimientos generales sobre el ecosistema de Spring (Spring Boot, Spring REST, Spring MVC, Spring Security)"
  },
  "contact": {
    "touch1": "Pongámonos en contacto",
    "touch2": "contacto",
    "name": "Introduce tu nombre:",
    "email": "Introduce tu correo electrónico:",
    "subject": "Introduce el asunto:",
    "message": "Introduce el mensaje:",
    "send": "Enviar mensaje"
  }
}