{
  "language": "Elija un idioma",
  "title": "Iván Pérez - Portfolio",
  "hello": "Hola! Soy",
  "tagline": "Ingeniero de Software",
  "location": "Madrid, Spain",
  "age": "12 de junio de 1995",
  "education": {
    "title": "Educación",
    "degree1": "Grado en Ingeniería del Software",
    "degree2": "Bachillerato",
    "uni": "Universidad Rey Juan Carlos",
    "school": "Colegio La Salle Griñón"
  },
  "languages": {
    "title": "Idiomas",
    "choose": "Elija un idioma:",
    "es": "Español",
    "en": "Inglés",
    "native": "(Nativo)"
  },
  "interest": {
    "title": "Intereses",
    "algorithm": "&#9679 Algoritmia",
    "cp": "&#9679 Programación Competitiva"
  },
  "hobbies": {
    "r": "&#9679 Leer",
    "t": "&#9679 Viajar",
    "vg": "&#9679 Videojuegos"
  },
  "summary": {
    "title": "Perfil profesional",
    "t1": "Soy una persona a la que le gusta trabajar en equipo, con una estupenda gestión del tiempo y un enfoque pensado en el usuario. Me considero un ingeniero creativo y energético.",
    "t2": "Actualmente estoy trabajando en el proyecto final de grado, enfocado en desarrollar y trabajar con algoritmos TSP junto con su libreria oficial."
  },
  "personalProfile": {
    "title": "Perfil personal",
    "p2": "He desarrollado software en distintos lenguajes, con una preferencia por Java , Python y en menor medida C.",
    "job1": "Desarrollador independiente",
    "job2": "Desarrollador de Software",
    "date1": "2016 - Hoy",
    "date2": "Dec 2018 - Hoy",
    "company1": "Proyectos personales y colaborativos",
    "company2": "Work4Data | I+D Software Lab",
    "details": {
      "p1": "Desarrollo de un 'space invaders' en android y luego aplicar con esta  BDD con Jenkins/Cucumber y diferentes heramientas de testing como Selenium. ",
      "p2": "Colaborando para desarrollar un bot de Telegram que facilita la automatización de tareas.",
      "p3": "He trabajado con Java + Spring para multiples proyectos. He desarrollado un API RESTful para una aplicación que simulaba el funcionamiento de un gimnasio online.",
      "p11": "Desarrollador Frontend y Backend. He trabajado con Spring Boot, AngularJS, Bootstrap, PostgreSQL, OracleSQL, MSSQL.",
      "p12": "Implementación con Hibernate/JPA, desarrollo con Java/Maven.",
      "p13": "Conocimiento general de APIs RESTful y JSON. Experiencia en Webservices (REST and SOAP).",
      "p14": "Experiencia en el desarrollo ágil. Integración continuna / Entrega continua usando herramientas DevOps como Git, GitLab, Jira, y Jenkins."
    }
  },
  "projectsCourses": {
    "title": "Otros proyectos y cursos",
    "description1": "Otros proyectos, cursos y MOOCs que he hecho",
    "description2": "Puedes ver todo lo que estoy haciendo en mi Github.",
    "fiturjc": "Una web responsive simulando el funcionamiento de un gimnasio, usando Spring FrameWork, Angular 5, MySQL, Bootstrap Template y HTML/CSS para el desarrollo.",
    "competitive": "Repositorio para resolver distinto problemas de programación competitiva, de multiples jueces online como SPOJ o 'Acepta el reto' ,por hobby.",
    "onlineCourses": {
      "title": "Cursos Online",
      "course1": "Cursos sobre Java y Python.",
      "course2": "Mejores practicas en el desarollo de software y testing.",
      "course3": "Conceptos basicos de ciberseguridad, los principales ataques y sus contramedidas.",
      "course4": "Conceptos basicos y avanzados sobre el desarrollo ágil en todas sus etapas, así como su historia",
      "course5": "Conocimiento básico sobre Scrum, etapas y roles dentro del modelo",
      "course6": "Iniciación para participar en competiciones reales: Capacidad para escribir codigo eficiente, seguro y breve. También aprendí a administraerme el tiempo y a aplicar conceptos de algoritmia a problemas reales.",
      "course7": "Introducción a Git",
      "course8": "Iniciación a git, su workflow y comandos."
    }
  },
  "skills": {
    "title": "Habilidades & Competencia",
    "p1": "Desarrollador backend con pasión por las APIs. Con un gran interés en Estructura de datos, Algoritmia y la resolución de problemas",
    "p2": "Conocimiento sólido sobre los sistemas de control de versiones (Git) y estrategias eficientes de administración de ramas y mergeo.",
    "p3": "Experiencia usando herramientas de desarrollo ágil e integracion continua.",
    "p4": "Conocimientos generales sobre el ecosistema de Spring (Spring Boot, Spring REST, Spring MVC, Spring Security)"
  },
  "contact": {
    "touch1": "Pongámonos en contacto",
    "touch2": "contacto",
    "name": "Introduce tu nombre:",
    "email": "Introduce tu email:",
    "subject": "Introduce el asunto:",
    "message": "Introduce el mensaje:",
    "send": "Enviar mensaje"
  }
}